#### OpenTofu Plan 📖`success`

<details><summary>Show Plan</summary>

```

Acquiring state lock. This may take a few moments...
data.aws_caller_identity.current: Reading...
data.aws_region.current: Reading...
data.aws_ami.ubuntu: Reading...
data.aws_region.current: Read complete after 0s [id=eu-west-2]
data.aws_caller_identity.current: Read complete after 0s [id=954976300695]
data.aws_ami.ubuntu: Read complete after 0s [id=ami-03ceeb33c1e4abcd1]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # aws_default_security_group.default will be created
  + resource "aws_default_security_group" "default" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "default-sg"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "Name"        = "default-sg"
          + "Project"     = "MoreThanCertified"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_instance.grafana_server["grafana-server"] will be created
  + resource "aws_instance" "grafana_server" {
      + ami                                  = "ami-03ceeb33c1e4abcd1"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = true
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = false
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name"    = "grafana-server"
          + "Purpose" = "Monitoring"
        }
      + tags_all                             = {
          + "Environment" = "dev"
          + "Name"        = "grafana-server"
          + "Project"     = "MoreThanCertified"
          + "Purpose"     = "Monitoring"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "6fae7190985225799b66190752252fc12446c8ef"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 1
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = true
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = {
              + "Name"    = "grafana-server-root-volume"
              + "Purpose" = "Monitoring"
            }
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 10
          + volume_type           = (known after apply)
        }
    }

  # aws_internet_gateway.gitops_igw will be created
  + resource "aws_internet_gateway" "gitops_igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "gitops-igw"
        }
      + tags_all = {
          + "Environment" = "dev"
          + "Name"        = "gitops-igw"
          + "Project"     = "MoreThanCertified"
        }
      + vpc_id   = (known after apply)
    }

  # aws_route_table.gitops_rt will be created
  + resource "aws_route_table" "gitops_rt" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name" = "gitops-rt"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "Name"        = "gitops-rt"
          + "Project"     = "MoreThanCertified"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.gitops_rta will be created
  + resource "aws_route_table_association" "gitops_rta" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_security_group.gitops_sg will be created
  + resource "aws_security_group" "gitops_sg" {
      + arn                    = (known after apply)
      + description            = "Allow port 3000"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "gitops_sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "gitops-sg"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "Name"        = "gitops-sg"
          + "Project"     = "MoreThanCertified"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_subnet.gitops_subnet will be created
  + resource "aws_subnet" "gitops_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = (known after apply)
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "gitops-subnet"
        }
      + tags_all                                       = {
          + "Environment" = "dev"
          + "Name"        = "gitops-subnet"
          + "Project"     = "MoreThanCertified"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.gitops_vpc will be created
  + resource "aws_vpc" "gitops_vpc" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "gitops-vpc"
        }
      + tags_all                             = {
          + "Environment" = "dev"
          + "Name"        = "gitops-vpc"
          + "Project"     = "MoreThanCertified"
        }
    }

  # aws_vpc_security_group_egress_rule.gitops_sg_egress_rule will be created
  + resource "aws_vpc_security_group_egress_rule" "gitops_sg_egress_rule" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "AWS-default egress rule"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name" = "gitops-sg-egress"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "Name"        = "gitops-sg-egress"
          + "Project"     = "MoreThanCertified"
        }
    }

  # aws_vpc_security_group_ingress_rule.gitops_sg_ingress_rule will be created
  + resource "aws_vpc_security_group_ingress_rule" "gitops_sg_ingress_rule" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow inbound traffic on port 3000"
      + from_port              = 3000
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name" = "gitops-sg-ingress"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "Name"        = "gitops-sg-ingress"
          + "Project"     = "MoreThanCertified"
        }
      + to_port                = 3000
    }

Plan: 10 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + grafana_ips = {
      + grafana-server = (known after apply)
    }

```

</details>

*Pusher: @kieran-lowe, Action: `pull_request`, Working Directory: ``, Workflow: `Deployment`*